HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_DPLL_MPVAL1_Bits.SIX1 */
#define IFX_GTM_DPLL_MPVAL1_SIX1_LEN (8)

/** \\brief  Mask for Ifx_GTM_DPLL_MPVAL1_Bits.SIX1 */
#define IFX_GTM_DPLL_MPVAL1_SIX1_MSK (0xff)

/** \\brief  Offset for Ifx_GTM_DPLL_MPVAL1_Bits.SIX1 */
#define IFX_GTM_DPLL_MPVAL1_SIX1_OFF (16)

/** \\brief  Length for Ifx_GTM_DPLL_MPVAL2_Bits.MPVAL2 */
#define IFX_GTM_DPLL_MPVAL2_MPVAL2_LEN (16)

/** \\brief  Mask for Ifx_GTM_DPLL_MPVAL2_Bits.MPVAL2 */
#define IFX_GTM_DPLL_MPVAL2_MPVAL2_MSK (0xffff)

/** \\brief  Offset for Ifx_GTM_DPLL_MPVAL2_Bits.MPVAL2 */
#define IFX_GTM_DPLL_MPVAL2_MPVAL2_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_MPVAL2_Bits.SIX2 */
#define IFX_GTM_DPLL_MPVAL2_SIX2_LEN (8)

/** \\brief  Mask for Ifx_GTM_DPLL_MPVAL2_Bits.SIX2 */
#define IFX_GTM_DPLL_MPVAL2_SIX2_MSK (0xff)

/** \\brief  Offset for Ifx_GTM_DPLL_MPVAL2_Bits.SIX2 */
#define IFX_GTM_DPLL_MPVAL2_SIX2_OFF (16)

/** \\brief  Length for Ifx_GTM_DPLL_NA_Bits.DB */
#define IFX_GTM_DPLL_NA_DB_LEN (10)

/** \\brief  Mask for Ifx_GTM_DPLL_NA_Bits.DB */
#define IFX_GTM_DPLL_NA_DB_MSK (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_NA_Bits.DB */
#define IFX_GTM_DPLL_NA_DB_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_NA_Bits.DW */
#define IFX_GTM_DPLL_NA_DW_LEN (10)

/** \\brief  Mask for Ifx_GTM_DPLL_NA_Bits.DW */
#define IFX_GTM_DPLL_NA_DW_MSK (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_NA_Bits.DW */
#define IFX_GTM_DPLL_NA_DW_OFF (10)

/** \\brief  Length for Ifx_GTM_DPLL_NMB_S_Bits.NMB_S */
#define IFX_GTM_DPLL_NMB_S_NMB_S_LEN (20)

/** \\brief  Mask for Ifx_GTM_DPLL_NMB_S_Bits.NMB_S */
#define IFX_GTM_DPLL_NMB_S_NMB_S_MSK (0xfffff)

/** \\brief  Offset for Ifx_GTM_DPLL_NMB_S_Bits.NMB_S */
#define IFX_GTM_DPLL_NMB_S_NMB_S_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_NMB_S_TAR_Bits.NMB_S_TAR */
#define IFX_GTM_DPLL_NMB_S_TAR_NMB_S_TAR_LEN (20)

/** \\brief  Mask for Ifx_GTM_DPLL_NMB_S_TAR_Bits.NMB_S_TAR */
#define IFX_GTM_DPLL_NMB_S_TAR_NMB_S_TAR_MSK (0xfffff)

/** \\brief  Offset for Ifx_GTM_DPLL_NMB_S_TAR_Bits.NMB_S_TAR */
#define IFX_GTM_DPLL_NMB_S_TAR_NMB_S_TAR_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_NMB_S_TAR_OLD_Bits.NMB_S_TAR_OLD */
#define IFX_GTM_DPLL_NMB_S_TAR_OLD_NMB_S_TAR_OLD_LEN (20)

/** \\brief  Mask for Ifx_GTM_DPLL_NMB_S_TAR_OLD_Bits.NMB_S_TAR_OLD */
#define IFX_GTM_DPLL_NMB_S_TAR_OLD_NMB_S_TAR_OLD_MSK (0xfffff)

/** \\brief  Offset for Ifx_GTM_DPLL_NMB_S_TAR_OLD_Bits.NMB_S_TAR_OLD */
#define IFX_GTM_DPLL_NMB_S_TAR_OLD_NMB_S_TAR_OLD_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_NMB_T_Bits.NMB_T */
#define IFX_GTM_DPLL_NMB_T_NMB_T_LEN (16)

/** \\brief  Mask for Ifx_GTM_DPLL_NMB_T_Bits.NMB_T */
#define IFX_GTM_DPLL_NMB_T_NMB_T_MSK (0xffff)

/** \\brief  Offset for Ifx_GTM_DPLL_NMB_T_Bits.NMB_T */
#define IFX_GTM_DPLL_NMB_T_NMB_T_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_NMB_T_TAR_Bits.NMB_T_TAR */
#define IFX_GTM_DPLL_NMB_T_TAR_NMB_T_TAR_LEN (16)

/** \\brief  Mask for Ifx_GTM_DPLL_NMB_T_TAR_Bits.NMB_T_TAR */
#define IFX_GTM_DPLL_NMB_T_TAR_NMB_T_TAR_MSK (0xffff)

/** \\brief  Offset for Ifx_GTM_DPLL_NMB_T_TAR_Bits.NMB_T_TAR */
#define IFX_GTM_DPLL_NMB_T_TAR_NMB_T_TAR_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_NMB_T_TAR_OLD_Bits.NMB_T_TAR_OLD */
#define IFX_GTM_DPLL_NMB_T_TAR_OLD_NMB_T_TAR_OLD_LEN (16)

/** \\brief  Mask for Ifx_GTM_DPLL_NMB_T_TAR_OLD_Bits.NMB_T_TAR_OLD */
#define IFX_GTM_DPLL_NMB_T_TAR_OLD_NMB_T_TAR_OLD_MSK (0xffff)

/** \\brief  Offset for Ifx_GTM_DPLL_NMB_T_TAR_OLD_Bits.NMB_T_TAR_OLD */
#define IFX_GTM_DPLL_NMB_T_TAR_OLD_NMB_T_TAR_OLD_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_NTI_CNT_Bits.NTI_CNT */
#define IFX_GTM_DPLL_NTI_CNT_NTI_CNT_LEN (10)

/** \\brief  Mask for Ifx_GTM_DPLL_NTI_CNT_Bits.NTI_CNT */
#define IFX_GTM_DPLL_NTI_CNT_NTI_CNT_MSK (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_NTI_CNT_Bits.NTI_CNT */
#define IFX_GTM_DPLL_NTI_CNT_NTI_CNT_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_NUSC_Bits.FSS */
#define IFX_GTM_DPLL_NUSC_FSS_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_NUSC_Bits.FSS */
#define IFX_GTM_DPLL_NUSC_FSS_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_NUSC_Bits.FSS */
#define IFX_GTM_DPLL_NUSC_FSS_OFF (6)

/** \\brief  Length for Ifx_GTM_DPLL_NUSC_Bits.NUSE */
#define IFX_GTM_DPLL_NUSC_NUSE_LEN (6)

/** \\brief  Mask for Ifx_GTM_DPLL_NUSC_Bits.NUSE */
#define IFX_GTM_DPLL_NUSC_NUSE_MSK (0x3f)

/** \\brief  Offset for Ifx_GTM_DPLL_NUSC_Bits.NUSE */
#define IFX_GTM_DPLL_NUSC_NUSE_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_NUSC_Bits.SYN_S */
#define IFX_GTM_DPLL_NUSC_SYN_S_LEN (6)

/** \\brief  Mask for Ifx_GTM_DPLL_NUSC_Bits.SYN_S */
#define IFX_GTM_DPLL_NUSC_SYN_S_MSK (0x3f)

/** \\brief  Offset for Ifx_GTM_DPLL_NUSC_Bits.SYN_S */
#define IFX_GTM_DPLL_NUSC_SYN_S_OFF (7)

/** \\brief  Length for Ifx_GTM_DPLL_NUSC_Bits.SYN_S_OLD */
#define IFX_GTM_DPLL_NUSC_SYN_S_OLD_LEN (6)

/** \\brief  Mask for Ifx_GTM_DPLL_NUSC_Bits.SYN_S_OLD */
#define IFX_GTM_DPLL_NUSC_SYN_S_OLD_MSK (0x3f)

/** \\brief  Offset for Ifx_GTM_DPLL_NUSC_Bits.SYN_S_OLD */
#define IFX_GTM_DPLL_NUSC_SYN_S_OLD_OFF (13)

/** \\brief  Length for Ifx_GTM_DPLL_NUSC_Bits.VSN */
#define IFX_GTM_DPLL_NUSC_VSN_LEN (6)

/** \\brief  Mask for Ifx_GTM_DPLL_NUSC_Bits.VSN */
#define IFX_GTM_DPLL_NUSC_VSN_MSK (0x3f)

/** \\brief  Offset for Ifx_GTM_DPLL_NUSC_Bits.VSN */
#define IFX_GTM_DPLL_NUSC_VSN_OFF (19)

/** \\brief  Length for Ifx_GTM_DPLL_NUSC_Bits.WNUS */
#define IFX_GTM_DPLL_NUSC_WNUS_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_NUSC_Bits.WNUS */
#define IFX_GTM_DPLL_NUSC_WNUS_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_NUSC_Bits.WNUS */
#define IFX_GTM_DPLL_NUSC_WNUS_OFF (29)

/** \\brief  Length for Ifx_GTM_DPLL_NUSC_Bits.WSYN */
#define IFX_GTM_DPLL_NUSC_WSYN_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_NUSC_Bits.WSYN */
#define IFX_GTM_DPLL_NUSC_WSYN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_NUSC_Bits.WSYN */
#define IFX_GTM_DPLL_NUSC_WSYN_OFF (30)

/** \\brief  Length for Ifx_GTM_DPLL_NUSC_Bits.WVSN */
#define IFX_GTM_DPLL_NUSC_WVSN_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_NUSC_Bits.WVSN */
#define IFX_GTM_DPLL_NUSC_WVSN_MSK (0x1)

