HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_DPLL_THVAL_Bits.THVAL */
#define IFX_GTM_DPLL_THVAL_THVAL_LEN (16)

/** \\brief  Mask for Ifx_GTM_DPLL_THVAL_Bits.THVAL */
#define IFX_GTM_DPLL_THVAL_THVAL_MSK (0xffff)

/** \\brief  Offset for Ifx_GTM_DPLL_THVAL_Bits.THVAL */
#define IFX_GTM_DPLL_THVAL_THVAL_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_TLR_Bits.TLR */
#define IFX_GTM_DPLL_TLR_TLR_LEN (8)

/** \\brief  Mask for Ifx_GTM_DPLL_TLR_Bits.TLR */
#define IFX_GTM_DPLL_TLR_TLR_MSK (0xff)

/** \\brief  Offset for Ifx_GTM_DPLL_TLR_Bits.TLR */
#define IFX_GTM_DPLL_TLR_TLR_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_TOV_Bits.DB */
#define IFX_GTM_DPLL_TOV_DB_LEN (10)

/** \\brief  Mask for Ifx_GTM_DPLL_TOV_Bits.DB */
#define IFX_GTM_DPLL_TOV_DB_MSK (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_TOV_Bits.DB */
#define IFX_GTM_DPLL_TOV_DB_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_TOV_Bits.DW */
#define IFX_GTM_DPLL_TOV_DW_LEN (6)

/** \\brief  Mask for Ifx_GTM_DPLL_TOV_Bits.DW */
#define IFX_GTM_DPLL_TOV_DW_MSK (0x3f)

/** \\brief  Offset for Ifx_GTM_DPLL_TOV_Bits.DW */
#define IFX_GTM_DPLL_TOV_DW_OFF (10)

/** \\brief  Length for Ifx_GTM_DPLL_TOV_S_Bits.DB */
#define IFX_GTM_DPLL_TOV_S_DB_LEN (10)

/** \\brief  Mask for Ifx_GTM_DPLL_TOV_S_Bits.DB */
#define IFX_GTM_DPLL_TOV_S_DB_MSK (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_TOV_S_Bits.DB */
#define IFX_GTM_DPLL_TOV_S_DB_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_TOV_S_Bits.DW */
#define IFX_GTM_DPLL_TOV_S_DW_LEN (6)

/** \\brief  Mask for Ifx_GTM_DPLL_TOV_S_Bits.DW */
#define IFX_GTM_DPLL_TOV_S_DW_MSK (0x3f)

/** \\brief  Offset for Ifx_GTM_DPLL_TOV_S_Bits.DW */
#define IFX_GTM_DPLL_TOV_S_DW_OFF (10)

/** \\brief  Length for Ifx_GTM_DPLL_TS_S_0_Bits.STATE_TS */
#define IFX_GTM_DPLL_TS_S_0_STATE_TS_LEN (24)

/** \\brief  Mask for Ifx_GTM_DPLL_TS_S_0_Bits.STATE_TS */
#define IFX_GTM_DPLL_TS_S_0_STATE_TS_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_TS_S_0_Bits.STATE_TS */
#define IFX_GTM_DPLL_TS_S_0_STATE_TS_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_TS_S_1_Bits.STATE_TS */
#define IFX_GTM_DPLL_TS_S_1_STATE_TS_LEN (24)

/** \\brief  Mask for Ifx_GTM_DPLL_TS_S_1_Bits.STATE_TS */
#define IFX_GTM_DPLL_TS_S_1_STATE_TS_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_TS_S_1_Bits.STATE_TS */
#define IFX_GTM_DPLL_TS_S_1_STATE_TS_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_TS_T_0_Bits.TRIGGER_TS */
#define IFX_GTM_DPLL_TS_T_0_TRIGGER_TS_LEN (24)

/** \\brief  Mask for Ifx_GTM_DPLL_TS_T_0_Bits.TRIGGER_TS */
#define IFX_GTM_DPLL_TS_T_0_TRIGGER_TS_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_TS_T_0_Bits.TRIGGER_TS */
#define IFX_GTM_DPLL_TS_T_0_TRIGGER_TS_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_TS_T_1_Bits.TRIGGER_TS */
#define IFX_GTM_DPLL_TS_T_1_TRIGGER_TS_LEN (24)

/** \\brief  Mask for Ifx_GTM_DPLL_TS_T_1_Bits.TRIGGER_TS */
#define IFX_GTM_DPLL_TS_T_1_TRIGGER_TS_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_TS_T_1_Bits.TRIGGER_TS */
#define IFX_GTM_DPLL_TS_T_1_TRIGGER_TS_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_TSAC_Bits.TSAC */
#define IFX_GTM_DPLL_TSAC_TSAC_LEN (24)

/** \\brief  Mask for Ifx_GTM_DPLL_TSAC_Bits.TSAC */
#define IFX_GTM_DPLL_TSAC_TSAC_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_TSAC_Bits.TSAC */
#define IFX_GTM_DPLL_TSAC_TSAC_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_TSF_S_Bits.TSF_S */
#define IFX_GTM_DPLL_TSF_S_TSF_S_LEN (24)

/** \\brief  Mask for Ifx_GTM_DPLL_TSF_S_Bits.TSF_S */
#define IFX_GTM_DPLL_TSF_S_TSF_S_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_TSF_S_Bits.TSF_S */
#define IFX_GTM_DPLL_TSF_S_TSF_S_OFF (0)

/** \\brief  Length for Ifx_GTM_DXINCON_Bits.DSS00 */
#define IFX_GTM_DXINCON_DSS00_LEN (1)

/** \\brief  Mask for Ifx_GTM_DXINCON_Bits.DSS00 */
#define IFX_GTM_DXINCON_DSS00_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DXINCON_Bits.DSS00 */
#define IFX_GTM_DXINCON_DSS00_OFF (16)

/** \\brief  Length for Ifx_GTM_DXINCON_Bits.DSS01 */
#define IFX_GTM_DXINCON_DSS01_LEN (1)

/** \\brief  Mask for Ifx_GTM_DXINCON_Bits.DSS01 */
#define IFX_GTM_DXINCON_DSS01_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DXINCON_Bits.DSS01 */
#define IFX_GTM_DXINCON_DSS01_OFF (17)

/** \\brief  Length for Ifx_GTM_DXINCON_Bits.DSS02 */
#define IFX_GTM_DXINCON_DSS02_LEN (1)

/** \\brief  Mask for Ifx_GTM_DXINCON_Bits.DSS02 */
#define IFX_GTM_DXINCON_DSS02_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DXINCON_Bits.DSS02 */
#define IFX_GTM_DXINCON_DSS02_OFF (18)

/** \\brief  Length for Ifx_GTM_DXINCON_Bits.DSS10 */
#define IFX_GTM_DXINCON_DSS10_LEN (1)

/** \\brief  Mask for Ifx_GTM_DXINCON_Bits.DSS10 */
#define IFX_GTM_DXINCON_DSS10_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DXINCON_Bits.DSS10 */
#define IFX_GTM_DXINCON_DSS10_OFF (24)

/** \\brief  Length for Ifx_GTM_DXINCON_Bits.DSS11 */
#define IFX_GTM_DXINCON_DSS11_LEN (1)

/** \\brief  Mask for Ifx_GTM_DXINCON_Bits.DSS11 */
#define IFX_GTM_DXINCON_DSS11_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DXINCON_Bits.DSS11 */
#define IFX_GTM_DXINCON_DSS11_OFF (25)

/** \\brief  Length for Ifx_GTM_DXINCON_Bits.DSS12 */
#define IFX_GTM_DXINCON_DSS12_LEN (1)

/** \\brief  Mask for Ifx_GTM_DXINCON_Bits.DSS12 */
#define IFX_GTM_DXINCON_DSS12_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DXINCON_Bits.DSS12 */
#define IFX_GTM_DXINCON_DSS12_OFF (26)

/** \\brief  Length for Ifx_GTM_DXINCON_Bits.IN00 */
#define IFX_GTM_DXINCON_IN00_LEN (1)

/** \\brief  Mask for Ifx_GTM_DXINCON_Bits.IN00 */
#define IFX_GTM_DXINCON_IN00_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DXINCON_Bits.IN00 */
#define IFX_GTM_DXINCON_IN00_OFF (0)

/** \\brief  Length for Ifx_GTM_DXINCON_Bits.IN01 */
#define IFX_GTM_DXINCON_IN01_LEN (1)

/** \\brief  Mask for Ifx_GTM_DXINCON_Bits.IN01 */
#define IFX_GTM_DXINCON_IN01_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DXINCON_Bits.IN01 */
#define IFX_GTM_DXINCON_IN01_OFF (1)

/** \\brief  Length for Ifx_GTM_DXINCON_Bits.IN02 */
#define IFX_GTM_DXINCON_IN02_LEN (1)

/** \\brief  Mask for Ifx_GTM_DXINCON_Bits.IN02 */
#define IFX_GTM_DXINCON_IN02_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DXINCON_Bits.IN02 */
#define IFX_GTM_DXINCON_IN02_OFF (2)

/** \\brief  Length for Ifx_GTM_DXINCON_Bits.IN10 */
#define IFX_GTM_DXINCON_IN10_LEN (1)

/** \\brief  Mask for Ifx_GTM_DXINCON_Bits.IN10 */
#define IFX_GTM_DXINCON_IN10_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DXINCON_Bits.IN10 */
#define IFX_GTM_DXINCON_IN10_OFF (8)

