HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_DXINCON_Bits.IN11 */
#define IFX_GTM_DXINCON_IN11_LEN (1)

/** \\brief  Mask for Ifx_GTM_DXINCON_Bits.IN11 */
#define IFX_GTM_DXINCON_IN11_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DXINCON_Bits.IN11 */
#define IFX_GTM_DXINCON_IN11_OFF (9)

/** \\brief  Length for Ifx_GTM_DXINCON_Bits.IN12 */
#define IFX_GTM_DXINCON_IN12_LEN (1)

/** \\brief  Mask for Ifx_GTM_DXINCON_Bits.IN12 */
#define IFX_GTM_DXINCON_IN12_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DXINCON_Bits.IN12 */
#define IFX_GTM_DXINCON_IN12_OFF (10)

/** \\brief  Length for Ifx_GTM_DXOUTCON_Bits.OUT00 */
#define IFX_GTM_DXOUTCON_OUT00_LEN (1)

/** \\brief  Mask for Ifx_GTM_DXOUTCON_Bits.OUT00 */
#define IFX_GTM_DXOUTCON_OUT00_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DXOUTCON_Bits.OUT00 */
#define IFX_GTM_DXOUTCON_OUT00_OFF (0)

/** \\brief  Length for Ifx_GTM_DXOUTCON_Bits.OUT01 */
#define IFX_GTM_DXOUTCON_OUT01_LEN (1)

/** \\brief  Mask for Ifx_GTM_DXOUTCON_Bits.OUT01 */
#define IFX_GTM_DXOUTCON_OUT01_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DXOUTCON_Bits.OUT01 */
#define IFX_GTM_DXOUTCON_OUT01_OFF (1)

/** \\brief  Length for Ifx_GTM_DXOUTCON_Bits.OUT02 */
#define IFX_GTM_DXOUTCON_OUT02_LEN (1)

/** \\brief  Mask for Ifx_GTM_DXOUTCON_Bits.OUT02 */
#define IFX_GTM_DXOUTCON_OUT02_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DXOUTCON_Bits.OUT02 */
#define IFX_GTM_DXOUTCON_OUT02_OFF (2)

/** \\brief  Length for Ifx_GTM_DXOUTCON_Bits.OUT10 */
#define IFX_GTM_DXOUTCON_OUT10_LEN (1)

/** \\brief  Mask for Ifx_GTM_DXOUTCON_Bits.OUT10 */
#define IFX_GTM_DXOUTCON_OUT10_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DXOUTCON_Bits.OUT10 */
#define IFX_GTM_DXOUTCON_OUT10_OFF (8)

/** \\brief  Length for Ifx_GTM_DXOUTCON_Bits.OUT11 */
#define IFX_GTM_DXOUTCON_OUT11_LEN (1)

/** \\brief  Mask for Ifx_GTM_DXOUTCON_Bits.OUT11 */
#define IFX_GTM_DXOUTCON_OUT11_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DXOUTCON_Bits.OUT11 */
#define IFX_GTM_DXOUTCON_OUT11_OFF (9)

/** \\brief  Length for Ifx_GTM_DXOUTCON_Bits.OUT12 */
#define IFX_GTM_DXOUTCON_OUT12_LEN (1)

/** \\brief  Mask for Ifx_GTM_DXOUTCON_Bits.OUT12 */
#define IFX_GTM_DXOUTCON_OUT12_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DXOUTCON_Bits.OUT12 */
#define IFX_GTM_DXOUTCON_OUT12_OFF (10)

/** \\brief  Length for Ifx_GTM_EIRQ_EN_Bits.AEI_IM_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_IM_ADDR_EIRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_EIRQ_EN_Bits.AEI_IM_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_IM_ADDR_EIRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_EIRQ_EN_Bits.AEI_IM_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_IM_ADDR_EIRQ_EN_OFF (2)

/** \\brief  Length for Ifx_GTM_EIRQ_EN_Bits.AEI_TO_XPT_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_TO_XPT_EIRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_EIRQ_EN_Bits.AEI_TO_XPT_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_TO_XPT_EIRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_EIRQ_EN_Bits.AEI_TO_XPT_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_TO_XPT_EIRQ_EN_OFF (0)

/** \\brief  Length for Ifx_GTM_EIRQ_EN_Bits.AEI_USP_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_USP_ADDR_EIRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_EIRQ_EN_Bits.AEI_USP_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_USP_ADDR_EIRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_EIRQ_EN_Bits.AEI_USP_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_USP_ADDR_EIRQ_EN_OFF (1)

/** \\brief  Length for Ifx_GTM_EIRQ_EN_Bits.AEI_USP_BE_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_USP_BE_EIRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_EIRQ_EN_Bits.AEI_USP_BE_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_USP_BE_EIRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_EIRQ_EN_Bits.AEI_USP_BE_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_USP_BE_EIRQ_EN_OFF (3)

/** \\brief  Length for Ifx_GTM_F2A_ENABLE_Bits.STR0_EN */
#define IFX_GTM_F2A_ENABLE_STR0_EN_LEN (2)

/** \\brief  Mask for Ifx_GTM_F2A_ENABLE_Bits.STR0_EN */
#define IFX_GTM_F2A_ENABLE_STR0_EN_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_F2A_ENABLE_Bits.STR0_EN */
#define IFX_GTM_F2A_ENABLE_STR0_EN_OFF (0)

/** \\brief  Length for Ifx_GTM_F2A_ENABLE_Bits.STR1_EN */
#define IFX_GTM_F2A_ENABLE_STR1_EN_LEN (2)

/** \\brief  Mask for Ifx_GTM_F2A_ENABLE_Bits.STR1_EN */
#define IFX_GTM_F2A_ENABLE_STR1_EN_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_F2A_ENABLE_Bits.STR1_EN */
#define IFX_GTM_F2A_ENABLE_STR1_EN_OFF (2)

/** \\brief  Length for Ifx_GTM_F2A_ENABLE_Bits.STR2_EN */
#define IFX_GTM_F2A_ENABLE_STR2_EN_LEN (2)

/** \\brief  Mask for Ifx_GTM_F2A_ENABLE_Bits.STR2_EN */
#define IFX_GTM_F2A_ENABLE_STR2_EN_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_F2A_ENABLE_Bits.STR2_EN */
#define IFX_GTM_F2A_ENABLE_STR2_EN_OFF (4)

/** \\brief  Length for Ifx_GTM_F2A_ENABLE_Bits.STR3_EN */
#define IFX_GTM_F2A_ENABLE_STR3_EN_LEN (2)

/** \\brief  Mask for Ifx_GTM_F2A_ENABLE_Bits.STR3_EN */
#define IFX_GTM_F2A_ENABLE_STR3_EN_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_F2A_ENABLE_Bits.STR3_EN */
#define IFX_GTM_F2A_ENABLE_STR3_EN_OFF (6)

/** \\brief  Length for Ifx_GTM_F2A_ENABLE_Bits.STR4_EN */
#define IFX_GTM_F2A_ENABLE_STR4_EN_LEN (2)

/** \\brief  Mask for Ifx_GTM_F2A_ENABLE_Bits.STR4_EN */
#define IFX_GTM_F2A_ENABLE_STR4_EN_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_F2A_ENABLE_Bits.STR4_EN */
#define IFX_GTM_F2A_ENABLE_STR4_EN_OFF (8)

/** \\brief  Length for Ifx_GTM_F2A_ENABLE_Bits.STR5_EN */
#define IFX_GTM_F2A_ENABLE_STR5_EN_LEN (2)

/** \\brief  Mask for Ifx_GTM_F2A_ENABLE_Bits.STR5_EN */
#define IFX_GTM_F2A_ENABLE_STR5_EN_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_F2A_ENABLE_Bits.STR5_EN */
#define IFX_GTM_F2A_ENABLE_STR5_EN_OFF (10)

/** \\brief  Length for Ifx_GTM_F2A_ENABLE_Bits.STR6_EN */
#define IFX_GTM_F2A_ENABLE_STR6_EN_LEN (2)

/** \\brief  Mask for Ifx_GTM_F2A_ENABLE_Bits.STR6_EN */
#define IFX_GTM_F2A_ENABLE_STR6_EN_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_F2A_ENABLE_Bits.STR6_EN */
#define IFX_GTM_F2A_ENABLE_STR6_EN_OFF (12)

/** \\brief  Length for Ifx_GTM_F2A_ENABLE_Bits.STR7_EN */
#define IFX_GTM_F2A_ENABLE_STR7_EN_LEN (2)

/** \\brief  Mask for Ifx_GTM_F2A_ENABLE_Bits.STR7_EN */
#define IFX_GTM_F2A_ENABLE_STR7_EN_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_F2A_ENABLE_Bits.STR7_EN */
#define IFX_GTM_F2A_ENABLE_STR7_EN_OFF (14)

/** \\brief  Length for Ifx_GTM_F2A_RD_CH_ARU_RD_FIFO_Bits.ADDR */
#define IFX_GTM_F2A_RD_CH_ARU_RD_FIFO_ADDR_LEN (9)

