HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_FIFO_CH_IRQ_FORCINT_Bits.TRG_FIFO_FULL */
#define IFX_GTM_FIFO_CH_IRQ_FORCINT_TRG_FIFO_FULL_OFF (1)

/** \\brief  Length for Ifx_GTM_FIFO_CH_IRQ_FORCINT_Bits.TRG_FIFO_LWM */
#define IFX_GTM_FIFO_CH_IRQ_FORCINT_TRG_FIFO_LWM_LEN (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_IRQ_FORCINT_Bits.TRG_FIFO_LWM */
#define IFX_GTM_FIFO_CH_IRQ_FORCINT_TRG_FIFO_LWM_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_IRQ_FORCINT_Bits.TRG_FIFO_LWM */
#define IFX_GTM_FIFO_CH_IRQ_FORCINT_TRG_FIFO_LWM_OFF (2)

/** \\brief  Length for Ifx_GTM_FIFO_CH_IRQ_FORCINT_Bits.TRG_FIFO_UWM */
#define IFX_GTM_FIFO_CH_IRQ_FORCINT_TRG_FIFO_UWM_LEN (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_IRQ_FORCINT_Bits.TRG_FIFO_UWM */
#define IFX_GTM_FIFO_CH_IRQ_FORCINT_TRG_FIFO_UWM_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_IRQ_FORCINT_Bits.TRG_FIFO_UWM */
#define IFX_GTM_FIFO_CH_IRQ_FORCINT_TRG_FIFO_UWM_OFF (3)

/** \\brief  Length for Ifx_GTM_FIFO_CH_IRQ_MODE_Bits.DMA_HYST_DIR */
#define IFX_GTM_FIFO_CH_IRQ_MODE_DMA_HYST_DIR_LEN (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_IRQ_MODE_Bits.DMA_HYST_DIR */
#define IFX_GTM_FIFO_CH_IRQ_MODE_DMA_HYST_DIR_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_IRQ_MODE_Bits.DMA_HYST_DIR */
#define IFX_GTM_FIFO_CH_IRQ_MODE_DMA_HYST_DIR_OFF (3)

/** \\brief  Length for Ifx_GTM_FIFO_CH_IRQ_MODE_Bits.DMA_HYSTERESIS */
#define IFX_GTM_FIFO_CH_IRQ_MODE_DMA_HYSTERESIS_LEN (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_IRQ_MODE_Bits.DMA_HYSTERESIS */
#define IFX_GTM_FIFO_CH_IRQ_MODE_DMA_HYSTERESIS_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_IRQ_MODE_Bits.DMA_HYSTERESIS */
#define IFX_GTM_FIFO_CH_IRQ_MODE_DMA_HYSTERESIS_OFF (2)

/** \\brief  Length for Ifx_GTM_FIFO_CH_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_FIFO_CH_IRQ_MODE_IRQ_MODE_LEN (2)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_FIFO_CH_IRQ_MODE_IRQ_MODE_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_FIFO_CH_IRQ_MODE_IRQ_MODE_OFF (0)

/** \\brief  Length for Ifx_GTM_FIFO_CH_IRQ_NOTIFY_Bits.FIFO_EMPTY */
#define IFX_GTM_FIFO_CH_IRQ_NOTIFY_FIFO_EMPTY_LEN (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_IRQ_NOTIFY_Bits.FIFO_EMPTY */
#define IFX_GTM_FIFO_CH_IRQ_NOTIFY_FIFO_EMPTY_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_IRQ_NOTIFY_Bits.FIFO_EMPTY */
#define IFX_GTM_FIFO_CH_IRQ_NOTIFY_FIFO_EMPTY_OFF (0)

/** \\brief  Length for Ifx_GTM_FIFO_CH_IRQ_NOTIFY_Bits.FIFO_FULL */
#define IFX_GTM_FIFO_CH_IRQ_NOTIFY_FIFO_FULL_LEN (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_IRQ_NOTIFY_Bits.FIFO_FULL */
#define IFX_GTM_FIFO_CH_IRQ_NOTIFY_FIFO_FULL_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_IRQ_NOTIFY_Bits.FIFO_FULL */
#define IFX_GTM_FIFO_CH_IRQ_NOTIFY_FIFO_FULL_OFF (1)

/** \\brief  Length for Ifx_GTM_FIFO_CH_IRQ_NOTIFY_Bits.FIFO_LWM */
#define IFX_GTM_FIFO_CH_IRQ_NOTIFY_FIFO_LWM_LEN (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_IRQ_NOTIFY_Bits.FIFO_LWM */
#define IFX_GTM_FIFO_CH_IRQ_NOTIFY_FIFO_LWM_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_IRQ_NOTIFY_Bits.FIFO_LWM */
#define IFX_GTM_FIFO_CH_IRQ_NOTIFY_FIFO_LWM_OFF (2)

/** \\brief  Length for Ifx_GTM_FIFO_CH_IRQ_NOTIFY_Bits.FIFO_UWM */
#define IFX_GTM_FIFO_CH_IRQ_NOTIFY_FIFO_UWM_LEN (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_IRQ_NOTIFY_Bits.FIFO_UWM */
#define IFX_GTM_FIFO_CH_IRQ_NOTIFY_FIFO_UWM_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_IRQ_NOTIFY_Bits.FIFO_UWM */
#define IFX_GTM_FIFO_CH_IRQ_NOTIFY_FIFO_UWM_OFF (3)

/** \\brief  Length for Ifx_GTM_FIFO_CH_LOWER_WM_Bits.ADDR */
#define IFX_GTM_FIFO_CH_LOWER_WM_ADDR_LEN (10)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_LOWER_WM_Bits.ADDR */
#define IFX_GTM_FIFO_CH_LOWER_WM_ADDR_MSK (0x3ff)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_LOWER_WM_Bits.ADDR */
#define IFX_GTM_FIFO_CH_LOWER_WM_ADDR_OFF (0)

/** \\brief  Length for Ifx_GTM_FIFO_CH_RD_PTR_Bits.ADDR */
#define IFX_GTM_FIFO_CH_RD_PTR_ADDR_LEN (10)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_RD_PTR_Bits.ADDR */
#define IFX_GTM_FIFO_CH_RD_PTR_ADDR_MSK (0x3ff)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_RD_PTR_Bits.ADDR */
#define IFX_GTM_FIFO_CH_RD_PTR_ADDR_OFF (0)

/** \\brief  Length for Ifx_GTM_FIFO_CH_START_ADDR_Bits.ADDR */
#define IFX_GTM_FIFO_CH_START_ADDR_ADDR_LEN (10)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_START_ADDR_Bits.ADDR */
#define IFX_GTM_FIFO_CH_START_ADDR_ADDR_MSK (0x3ff)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_START_ADDR_Bits.ADDR */
#define IFX_GTM_FIFO_CH_START_ADDR_ADDR_OFF (0)

/** \\brief  Length for Ifx_GTM_FIFO_CH_STATUS_Bits.EMPTY */
#define IFX_GTM_FIFO_CH_STATUS_EMPTY_LEN (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_STATUS_Bits.EMPTY */
#define IFX_GTM_FIFO_CH_STATUS_EMPTY_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_STATUS_Bits.EMPTY */
#define IFX_GTM_FIFO_CH_STATUS_EMPTY_OFF (0)

/** \\brief  Length for Ifx_GTM_FIFO_CH_STATUS_Bits.FULL */
#define IFX_GTM_FIFO_CH_STATUS_FULL_LEN (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_STATUS_Bits.FULL */
#define IFX_GTM_FIFO_CH_STATUS_FULL_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_STATUS_Bits.FULL */
#define IFX_GTM_FIFO_CH_STATUS_FULL_OFF (1)

/** \\brief  Length for Ifx_GTM_FIFO_CH_STATUS_Bits.LOW_WM */
#define IFX_GTM_FIFO_CH_STATUS_LOW_WM_LEN (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_STATUS_Bits.LOW_WM */
#define IFX_GTM_FIFO_CH_STATUS_LOW_WM_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_STATUS_Bits.LOW_WM */
#define IFX_GTM_FIFO_CH_STATUS_LOW_WM_OFF (2)

/** \\brief  Length for Ifx_GTM_FIFO_CH_STATUS_Bits.UP_WM */
#define IFX_GTM_FIFO_CH_STATUS_UP_WM_LEN (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_STATUS_Bits.UP_WM */
#define IFX_GTM_FIFO_CH_STATUS_UP_WM_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_STATUS_Bits.UP_WM */
#define IFX_GTM_FIFO_CH_STATUS_UP_WM_OFF (3)

/** \\brief  Length for Ifx_GTM_FIFO_CH_UPPER_WM_Bits.ADDR */
#define IFX_GTM_FIFO_CH_UPPER_WM_ADDR_LEN (10)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_UPPER_WM_Bits.ADDR */
#define IFX_GTM_FIFO_CH_UPPER_WM_ADDR_MSK (0x3ff)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_UPPER_WM_Bits.ADDR */
#define IFX_GTM_FIFO_CH_UPPER_WM_ADDR_OFF (0)

/** \\brief  Length for Ifx_GTM_FIFO_CH_WR_PTR_Bits.ADDR */
#define IFX_GTM_FIFO_CH_WR_PTR_ADDR_LEN (10)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_WR_PTR_Bits.ADDR */
#define IFX_GTM_FIFO_CH_WR_PTR_ADDR_MSK (0x3ff)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_WR_PTR_Bits.ADDR */
#define IFX_GTM_FIFO_CH_WR_PTR_ADDR_OFF (0)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.AEI_IRQ */
#define IFX_GTM_ICM_IRQG_0_AEI_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.AEI_IRQ */
#define IFX_GTM_ICM_IRQG_0_AEI_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.AEI_IRQ */
#define IFX_GTM_ICM_IRQG_0_AEI_IRQ_OFF (4)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.ARU_ACC_ACK_IRQ */
#define IFX_GTM_ICM_IRQG_0_ARU_ACC_ACK_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.ARU_ACC_ACK_IRQ */
#define IFX_GTM_ICM_IRQG_0_ARU_ACC_ACK_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.ARU_ACC_ACK_IRQ */
#define IFX_GTM_ICM_IRQG_0_ARU_ACC_ACK_IRQ_OFF (2)

