HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.ARU_NEW_DATA0_IRQ */
#define IFX_GTM_ICM_IRQG_0_ARU_NEW_DATA0_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.ARU_NEW_DATA0_IRQ */
#define IFX_GTM_ICM_IRQG_0_ARU_NEW_DATA0_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.ARU_NEW_DATA0_IRQ */
#define IFX_GTM_ICM_IRQG_0_ARU_NEW_DATA0_IRQ_OFF (0)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.ARU_NEW_DATA1_IRQ */
#define IFX_GTM_ICM_IRQG_0_ARU_NEW_DATA1_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.ARU_NEW_DATA1_IRQ */
#define IFX_GTM_ICM_IRQG_0_ARU_NEW_DATA1_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.ARU_NEW_DATA1_IRQ */
#define IFX_GTM_ICM_IRQG_0_ARU_NEW_DATA1_IRQ_OFF (1)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.CMP_IRQ */
#define IFX_GTM_ICM_IRQG_0_CMP_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.CMP_IRQ */
#define IFX_GTM_ICM_IRQG_0_CMP_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.CMP_IRQ */
#define IFX_GTM_ICM_IRQG_0_CMP_IRQ_OFF (5)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH0_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH0_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH0_IRQ_OFF (16)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH1_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH1_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH1_IRQ_OFF (17)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH2_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH2_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH2_IRQ_OFF (18)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH3_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH3_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH3_IRQ_OFF (19)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH4_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH4_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH4_IRQ_OFF (20)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH5_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH5_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH5_IRQ_OFF (21)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH6_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH6_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH6_IRQ_OFF (22)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH7_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH7_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH7_IRQ_OFF (23)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.SPE0_IRQ */
#define IFX_GTM_ICM_IRQG_0_SPE0_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.SPE0_IRQ */
#define IFX_GTM_ICM_IRQG_0_SPE0_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.SPE0_IRQ */
#define IFX_GTM_ICM_IRQG_0_SPE0_IRQ_OFF (6)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.SPE1_IRQ */
#define IFX_GTM_ICM_IRQG_0_SPE1_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.SPE1_IRQ */
#define IFX_GTM_ICM_IRQG_0_SPE1_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.SPE1_IRQ */
#define IFX_GTM_ICM_IRQG_0_SPE1_IRQ_OFF (7)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_CDIS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_CDIS_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_CDIS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_CDIS_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_CDIS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_CDIS_IRQ_OFF (24)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_CDIT_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_CDIT_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_CDIT_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_CDIT_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_CDIT_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_CDIT_IRQ_OFF (23)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_DCG_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_DCG_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_DCG_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_DCG_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_DCG_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_DCG_IRQ_OFF (0)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_EDI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_EDI_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_EDI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_EDI_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_EDI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_EDI_IRQ_OFF (1)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_EI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_EI_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_EI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_EI_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_EI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_EI_IRQ_OFF (15)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_GL2I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_GL2I_IRQ_LEN (1)

