HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH6_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH6_IRQ_OFF (6)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH7_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH7_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH7_IRQ_OFF (7)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH0_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH0_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH0_IRQ_OFF (8)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH1_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH1_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH1_IRQ_OFF (9)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH2_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH2_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH2_IRQ_OFF (10)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH3_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH3_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH3_IRQ_OFF (11)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH4_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH4_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH4_IRQ_OFF (12)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH5_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH5_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH5_IRQ_OFF (13)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH6_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH6_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH6_IRQ_OFF (14)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH7_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH7_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH7_IRQ_OFF (15)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH0_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH0_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH0_IRQ_OFF (16)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH1_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH1_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH1_IRQ_OFF (17)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH2_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH2_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH2_IRQ_OFF (18)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH3_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH3_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH3_IRQ_OFF (19)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH4_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH4_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH4_IRQ_OFF (20)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH5_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH5_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH5_IRQ_OFF (21)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH6_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH6_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH6_IRQ_OFF (22)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH7_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH7_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH7_IRQ_OFF (23)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH0_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH0_IRQ_MSK (0x1)

