HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_MCS_CH_R1_Bits.DATA */
#define IFX_GTM_MCS_CH_R1_DATA_LEN (24)

/** \\brief  Mask for Ifx_GTM_MCS_CH_R1_Bits.DATA */
#define IFX_GTM_MCS_CH_R1_DATA_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_MCS_CH_R1_Bits.DATA */
#define IFX_GTM_MCS_CH_R1_DATA_OFF (0)

/** \\brief  Length for Ifx_GTM_MCS_CH_R2_Bits.DATA */
#define IFX_GTM_MCS_CH_R2_DATA_LEN (24)

/** \\brief  Mask for Ifx_GTM_MCS_CH_R2_Bits.DATA */
#define IFX_GTM_MCS_CH_R2_DATA_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_MCS_CH_R2_Bits.DATA */
#define IFX_GTM_MCS_CH_R2_DATA_OFF (0)

/** \\brief  Length for Ifx_GTM_MCS_CH_R3_Bits.DATA */
#define IFX_GTM_MCS_CH_R3_DATA_LEN (24)

/** \\brief  Mask for Ifx_GTM_MCS_CH_R3_Bits.DATA */
#define IFX_GTM_MCS_CH_R3_DATA_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_MCS_CH_R3_Bits.DATA */
#define IFX_GTM_MCS_CH_R3_DATA_OFF (0)

/** \\brief  Length for Ifx_GTM_MCS_CH_R4_Bits.DATA */
#define IFX_GTM_MCS_CH_R4_DATA_LEN (24)

/** \\brief  Mask for Ifx_GTM_MCS_CH_R4_Bits.DATA */
#define IFX_GTM_MCS_CH_R4_DATA_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_MCS_CH_R4_Bits.DATA */
#define IFX_GTM_MCS_CH_R4_DATA_OFF (0)

/** \\brief  Length for Ifx_GTM_MCS_CH_R5_Bits.DATA */
#define IFX_GTM_MCS_CH_R5_DATA_LEN (24)

/** \\brief  Mask for Ifx_GTM_MCS_CH_R5_Bits.DATA */
#define IFX_GTM_MCS_CH_R5_DATA_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_MCS_CH_R5_Bits.DATA */
#define IFX_GTM_MCS_CH_R5_DATA_OFF (0)

/** \\brief  Length for Ifx_GTM_MCS_CH_R6_Bits.DATA */
#define IFX_GTM_MCS_CH_R6_DATA_LEN (24)

/** \\brief  Mask for Ifx_GTM_MCS_CH_R6_Bits.DATA */
#define IFX_GTM_MCS_CH_R6_DATA_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_MCS_CH_R6_Bits.DATA */
#define IFX_GTM_MCS_CH_R6_DATA_OFF (0)

/** \\brief  Length for Ifx_GTM_MCS_CH_R7_Bits.DATA */
#define IFX_GTM_MCS_CH_R7_DATA_LEN (24)

/** \\brief  Mask for Ifx_GTM_MCS_CH_R7_Bits.DATA */
#define IFX_GTM_MCS_CH_R7_DATA_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_MCS_CH_R7_Bits.DATA */
#define IFX_GTM_MCS_CH_R7_DATA_OFF (0)

/** \\brief  Length for Ifx_GTM_MCS_CTRL_Bits.HLT_SP_OFL */
#define IFX_GTM_MCS_CTRL_HLT_SP_OFL_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CTRL_Bits.HLT_SP_OFL */
#define IFX_GTM_MCS_CTRL_HLT_SP_OFL_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CTRL_Bits.HLT_SP_OFL */
#define IFX_GTM_MCS_CTRL_HLT_SP_OFL_OFF (1)

/** \\brief  Length for Ifx_GTM_MCS_CTRL_Bits.RAM_RST */
#define IFX_GTM_MCS_CTRL_RAM_RST_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CTRL_Bits.RAM_RST */
#define IFX_GTM_MCS_CTRL_RAM_RST_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CTRL_Bits.RAM_RST */
#define IFX_GTM_MCS_CTRL_RAM_RST_OFF (16)

/** \\brief  Length for Ifx_GTM_MCS_CTRL_Bits.SCHED */
#define IFX_GTM_MCS_CTRL_SCHED_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CTRL_Bits.SCHED */
#define IFX_GTM_MCS_CTRL_SCHED_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CTRL_Bits.SCHED */
#define IFX_GTM_MCS_CTRL_SCHED_OFF (0)

/** \\brief  Length for Ifx_GTM_MCS_ERR_Bits.ERR0 */
#define IFX_GTM_MCS_ERR_ERR0_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_ERR_Bits.ERR0 */
#define IFX_GTM_MCS_ERR_ERR0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_ERR_Bits.ERR0 */
#define IFX_GTM_MCS_ERR_ERR0_OFF (0)

/** \\brief  Length for Ifx_GTM_MCS_ERR_Bits.ERR1 */
#define IFX_GTM_MCS_ERR_ERR1_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_ERR_Bits.ERR1 */
#define IFX_GTM_MCS_ERR_ERR1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_ERR_Bits.ERR1 */
#define IFX_GTM_MCS_ERR_ERR1_OFF (1)

/** \\brief  Length for Ifx_GTM_MCS_ERR_Bits.ERR2 */
#define IFX_GTM_MCS_ERR_ERR2_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_ERR_Bits.ERR2 */
#define IFX_GTM_MCS_ERR_ERR2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_ERR_Bits.ERR2 */
#define IFX_GTM_MCS_ERR_ERR2_OFF (2)

/** \\brief  Length for Ifx_GTM_MCS_ERR_Bits.ERR3 */
#define IFX_GTM_MCS_ERR_ERR3_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_ERR_Bits.ERR3 */
#define IFX_GTM_MCS_ERR_ERR3_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_ERR_Bits.ERR3 */
#define IFX_GTM_MCS_ERR_ERR3_OFF (3)

/** \\brief  Length for Ifx_GTM_MCS_ERR_Bits.ERR4 */
#define IFX_GTM_MCS_ERR_ERR4_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_ERR_Bits.ERR4 */
#define IFX_GTM_MCS_ERR_ERR4_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_ERR_Bits.ERR4 */
#define IFX_GTM_MCS_ERR_ERR4_OFF (4)

/** \\brief  Length for Ifx_GTM_MCS_ERR_Bits.ERR5 */
#define IFX_GTM_MCS_ERR_ERR5_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_ERR_Bits.ERR5 */
#define IFX_GTM_MCS_ERR_ERR5_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_ERR_Bits.ERR5 */
#define IFX_GTM_MCS_ERR_ERR5_OFF (5)

/** \\brief  Length for Ifx_GTM_MCS_ERR_Bits.ERR6 */
#define IFX_GTM_MCS_ERR_ERR6_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_ERR_Bits.ERR6 */
#define IFX_GTM_MCS_ERR_ERR6_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_ERR_Bits.ERR6 */
#define IFX_GTM_MCS_ERR_ERR6_OFF (6)

/** \\brief  Length for Ifx_GTM_MCS_ERR_Bits.ERR7 */
#define IFX_GTM_MCS_ERR_ERR7_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_ERR_Bits.ERR7 */
#define IFX_GTM_MCS_ERR_ERR7_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_ERR_Bits.ERR7 */
#define IFX_GTM_MCS_ERR_ERR7_OFF (7)

/** \\brief  Length for Ifx_GTM_MCS_RST_Bits.CAT0 */
#define IFX_GTM_MCS_RST_CAT0_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_RST_Bits.CAT0 */
#define IFX_GTM_MCS_RST_CAT0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_RST_Bits.CAT0 */
#define IFX_GTM_MCS_RST_CAT0_OFF (8)

/** \\brief  Length for Ifx_GTM_MCS_RST_Bits.CAT1 */
#define IFX_GTM_MCS_RST_CAT1_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_RST_Bits.CAT1 */
#define IFX_GTM_MCS_RST_CAT1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_RST_Bits.CAT1 */
#define IFX_GTM_MCS_RST_CAT1_OFF (9)

/** \\brief  Length for Ifx_GTM_MCS_RST_Bits.CAT2 */
#define IFX_GTM_MCS_RST_CAT2_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_RST_Bits.CAT2 */
#define IFX_GTM_MCS_RST_CAT2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_RST_Bits.CAT2 */
#define IFX_GTM_MCS_RST_CAT2_OFF (10)

/** \\brief  Length for Ifx_GTM_MCS_RST_Bits.CAT3 */
#define IFX_GTM_MCS_RST_CAT3_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_RST_Bits.CAT3 */
#define IFX_GTM_MCS_RST_CAT3_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_RST_Bits.CAT3 */
#define IFX_GTM_MCS_RST_CAT3_OFF (11)

