HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_MCSINTCLR_Bits.MCS010 */
#define IFX_GTM_MCSINTCLR_MCS010_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTCLR_Bits.MCS010 */
#define IFX_GTM_MCSINTCLR_MCS010_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTCLR_Bits.MCS010 */
#define IFX_GTM_MCSINTCLR_MCS010_OFF (2)

/** \\brief  Length for Ifx_GTM_MCSINTCLR_Bits.MCS011 */
#define IFX_GTM_MCSINTCLR_MCS011_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTCLR_Bits.MCS011 */
#define IFX_GTM_MCSINTCLR_MCS011_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTCLR_Bits.MCS011 */
#define IFX_GTM_MCSINTCLR_MCS011_OFF (3)

/** \\brief  Length for Ifx_GTM_MCSINTCLR_Bits.MCS100 */
#define IFX_GTM_MCSINTCLR_MCS100_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTCLR_Bits.MCS100 */
#define IFX_GTM_MCSINTCLR_MCS100_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTCLR_Bits.MCS100 */
#define IFX_GTM_MCSINTCLR_MCS100_OFF (4)

/** \\brief  Length for Ifx_GTM_MCSINTCLR_Bits.MCS101 */
#define IFX_GTM_MCSINTCLR_MCS101_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTCLR_Bits.MCS101 */
#define IFX_GTM_MCSINTCLR_MCS101_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTCLR_Bits.MCS101 */
#define IFX_GTM_MCSINTCLR_MCS101_OFF (5)

/** \\brief  Length for Ifx_GTM_MCSINTCLR_Bits.MCS110 */
#define IFX_GTM_MCSINTCLR_MCS110_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTCLR_Bits.MCS110 */
#define IFX_GTM_MCSINTCLR_MCS110_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTCLR_Bits.MCS110 */
#define IFX_GTM_MCSINTCLR_MCS110_OFF (6)

/** \\brief  Length for Ifx_GTM_MCSINTCLR_Bits.MCS111 */
#define IFX_GTM_MCSINTCLR_MCS111_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTCLR_Bits.MCS111 */
#define IFX_GTM_MCSINTCLR_MCS111_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTCLR_Bits.MCS111 */
#define IFX_GTM_MCSINTCLR_MCS111_OFF (7)

/** \\brief  Length for Ifx_GTM_MCSINTCLR_Bits.MCS200 */
#define IFX_GTM_MCSINTCLR_MCS200_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTCLR_Bits.MCS200 */
#define IFX_GTM_MCSINTCLR_MCS200_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTCLR_Bits.MCS200 */
#define IFX_GTM_MCSINTCLR_MCS200_OFF (8)

/** \\brief  Length for Ifx_GTM_MCSINTCLR_Bits.MCS201 */
#define IFX_GTM_MCSINTCLR_MCS201_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTCLR_Bits.MCS201 */
#define IFX_GTM_MCSINTCLR_MCS201_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTCLR_Bits.MCS201 */
#define IFX_GTM_MCSINTCLR_MCS201_OFF (9)

/** \\brief  Length for Ifx_GTM_MCSINTCLR_Bits.MCS210 */
#define IFX_GTM_MCSINTCLR_MCS210_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTCLR_Bits.MCS210 */
#define IFX_GTM_MCSINTCLR_MCS210_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTCLR_Bits.MCS210 */
#define IFX_GTM_MCSINTCLR_MCS210_OFF (10)

/** \\brief  Length for Ifx_GTM_MCSINTCLR_Bits.MCS211 */
#define IFX_GTM_MCSINTCLR_MCS211_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTCLR_Bits.MCS211 */
#define IFX_GTM_MCSINTCLR_MCS211_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTCLR_Bits.MCS211 */
#define IFX_GTM_MCSINTCLR_MCS211_OFF (11)

/** \\brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS000 */
#define IFX_GTM_MCSINTSTAT_MCS000_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS000 */
#define IFX_GTM_MCSINTSTAT_MCS000_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS000 */
#define IFX_GTM_MCSINTSTAT_MCS000_OFF (0)

/** \\brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS001 */
#define IFX_GTM_MCSINTSTAT_MCS001_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS001 */
#define IFX_GTM_MCSINTSTAT_MCS001_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS001 */
#define IFX_GTM_MCSINTSTAT_MCS001_OFF (1)

/** \\brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS010 */
#define IFX_GTM_MCSINTSTAT_MCS010_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS010 */
#define IFX_GTM_MCSINTSTAT_MCS010_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS010 */
#define IFX_GTM_MCSINTSTAT_MCS010_OFF (2)

/** \\brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS011 */
#define IFX_GTM_MCSINTSTAT_MCS011_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS011 */
#define IFX_GTM_MCSINTSTAT_MCS011_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS011 */
#define IFX_GTM_MCSINTSTAT_MCS011_OFF (3)

/** \\brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS100 */
#define IFX_GTM_MCSINTSTAT_MCS100_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS100 */
#define IFX_GTM_MCSINTSTAT_MCS100_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS100 */
#define IFX_GTM_MCSINTSTAT_MCS100_OFF (4)

/** \\brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS101 */
#define IFX_GTM_MCSINTSTAT_MCS101_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS101 */
#define IFX_GTM_MCSINTSTAT_MCS101_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS101 */
#define IFX_GTM_MCSINTSTAT_MCS101_OFF (5)

/** \\brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS110 */
#define IFX_GTM_MCSINTSTAT_MCS110_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS110 */
#define IFX_GTM_MCSINTSTAT_MCS110_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS110 */
#define IFX_GTM_MCSINTSTAT_MCS110_OFF (6)

/** \\brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS111 */
#define IFX_GTM_MCSINTSTAT_MCS111_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS111 */
#define IFX_GTM_MCSINTSTAT_MCS111_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS111 */
#define IFX_GTM_MCSINTSTAT_MCS111_OFF (7)

/** \\brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS200 */
#define IFX_GTM_MCSINTSTAT_MCS200_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS200 */
#define IFX_GTM_MCSINTSTAT_MCS200_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS200 */
#define IFX_GTM_MCSINTSTAT_MCS200_OFF (8)

/** \\brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS201 */
#define IFX_GTM_MCSINTSTAT_MCS201_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS201 */
#define IFX_GTM_MCSINTSTAT_MCS201_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS201 */
#define IFX_GTM_MCSINTSTAT_MCS201_OFF (9)

/** \\brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS210 */
#define IFX_GTM_MCSINTSTAT_MCS210_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS210 */
#define IFX_GTM_MCSINTSTAT_MCS210_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS210 */
#define IFX_GTM_MCSINTSTAT_MCS210_OFF (10)

/** \\brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS211 */
#define IFX_GTM_MCSINTSTAT_MCS211_LEN (1)

